import os
from dotenv import load_dotenv

load_dotenv()

KIS_APP_KEY = os.getenv("KIS_APP_KEY")
KIS_APP_SECRET = os.getenv("KIS_APP_SECRET")
KIS_ACCOUNT_NUMBER = os.getenv("KIS_ACCOUNT_NUMBER")

KIS_BASE_URL = "https://openapi.koreainvestment.com:9443"
KIS_WS_URL = "ws://ops.koreainvestment.com:21000"

# 테마별 종목 매핑 (종목코드: 종목명)
THEMES = {
    "해운 관련주": {
        "005880": "대한해운",
        "175330": "STX그린로지스",
        "003280": "흥아해운",
        "011200": "HMM",
        "028670": "팬오션",
    },
    "방산/전쟁": {
        "012450": "한화에어로스페이스",
        "064350": "현대로템",
        "047810": "한국항공우주",
        "016680": "대성하이텍",
        "272210": "한화시스템",
        "092460": "한일단조",
        "005870": "휴니드",
        "079550": "LIG넥스원",
        "065450": "빅텍",
    },
    "석유 전쟁": {
        "004090": "한국석유",
        "024060": "흥구석유",
        "000440": "중앙에너비스",
        "096770": "SK이노베이션",
        "002960": "한국쉘석유",
    },
    "태양광 에너지": {
        "389260": "대명에너지",
        "010060": "OCI홀딩스",
        "322000": "HD현대에너지솔루션",
        "011930": "신성이엔지",
        "009830": "한화솔루션",
        "099220": "SDN",
    },
    "풍력 관련주": {
        "100090": "SK오션플랜트",
        "112610": "씨에스윈드",
        "044490": "태웅",
        "297090": "씨에스베어링",
        "003030": "세아제강지주",
    },
    "ESS 관련주": {
        "066970": "엘앤에프",
        "373220": "LG에너지솔루션",
        "006400": "삼성SDI",
        "178320": "서진시스템",
        "092300": "한중엔시에스",
    },
    "수소 관련주": {
        "336260": "두산퓨얼셀",
        "126340": "비나텍",
        "382900": "범한퓨얼셀",
        "014580": "태경비케이",
        "396690": "한선엔지니어링",
    },
    "2차전지 소재/부품": {
        "054090": "삼진엘앤디",
        "161000": "애경케미칼",
        "247540": "에코프로비엠",
        "003670": "포스코퓨처엠",
        "025620": "이구산업",
        "317330": "덕산테코피아",
    },
}
